masarray/arstack61850/embedded/esp32p4_smv_injector/main/ptp_lab_task.cpp
// SPDX-License-Identifier: GPL-3.0-or-later

#include "ptp_lab_task.hpp"

#include "ariec61850/time_sync/ptp.hpp"
#include "ariec61850/time_sync/ptp_runtime.hpp"

#include "esp_err.h"
#include "esp_eth.h"
#include "esp_eth_driver.h"
#include "esp_eth_mac.h"
#include "esp_idf_version.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "sdkconfig.h"
#include "soc/soc_caps.h"

#if ESP_IDF_VERSION_MAJOR < 6
#include "esp_eth_mac_esp.h"
#endif

#include <algorithm>
#include <array>
#include <atomic>
#include <chrono>
#include <cstdint>
#include <cstdlib>
#include <ctime>
#include <iterator>
#include <limits>
#include <optional>
#include <span>
#include <string>
#include <utility>
#include <vector>

namespace ar::esp32p4::smv {
namespace {

using ar::iec61850::time_sync::PtpClockAccuracy;
using ar::iec61850::time_sync::PtpFrame;
using ar::iec61850::time_sync::PtpMessageType;
using ar::iec61850::time_sync::PtpPortIdentity;
using ar::iec61850::time_sync::PtpPublisherOptions;
using ar::iec61850::time_sync::PtpPublisherRuntime;
using ar::iec61850::time_sync::PtpTimeSource;
using ar::iec61850::time_sync::PtpTimestamp;
using ar::iec61850::time_sync::format_ptp_clock_identity;
using ar::iec61850::time_sync::ptp_clock_identity_from_mac;
using ar::iec61850::time_sync::try_parse_ptp_clock_identity;

constexpr char kTag[] = "ar_ptp_lab";
constexpr TickType_t kStartupDelay = pdMS_TO_TICKS(500);
constexpr UBaseType_t kPdelayQueueDepth = 8U;
constexpr std::array<std::uint8_t, 6> kValidationMac{
    0x02U, 0x00U, 0x00U, 0x00U, 0x00U, 0x01U};

struct PdelayRequestEvent final {
    PtpPortIdentity requesting_port_identity{};
    PtpTimestamp receive_timestamp{};
    std::uint16_t sequence_id{};
    std::int8_t log_message_interval{};
};

struct PtpLabContext final {
    esp_eth_handle_t eth_handle{};
    std::array<std::uint8_t, 6> source_mac{};
    QueueHandle_t pdelay_queue{};
    TaskHandle_t task_handle{};
    std::optional<PtpPublisherRuntime> runtime;
    std::uint8_t rx_domain{};
    std::uint8_t rx_transport_specific{};
    bool rx_respond_to_peer_delay{};
};

PtpLabContext g_ptp_context{};
std::atomic_bool g_ptp_started{false};
std::atomic_bool g_ptp_ready{false};
std::atomic_bool g_stop_requested{false};
std::atomic_bool g_ptp_accept_rx{false};
std::atomic<std::uint64_t> g_announce_sent{0U};
std::atomic<std::uint64_t> g_sync_sent{0U};
std::atomic<std::uint64_t> g_follow_up_sent{0U};
std::atomic<std::uint64_t> g_pdelay_frames_sent{0U};
std::atomic<std::uint64_t> g_tx_failure_count{0U};

portMUX_TYPE g_control_mux = portMUX_INITIALIZER_UNLOCKED;
ar_ptp_lab_config_t g_runtime_config_override{};
bool g_runtime_config_override_valid = false;

[[nodiscard]] bool all_zero_identity(const std::uint8_t (&identity)[8]) noexcept {
    return std::all_of(
        std::begin(identity),
        std::end(identity),
        [](const std::uint8_t value) { return value == 0U; });
}

void fill_kconfig_defaults(ar_ptp_lab_config_t& config) noexcept {
    config = {};
    config.transport_specific = static_cast<std::uint8_t>(CONFIG_AR_PTP_TRANSPORT_SPECIFIC);
    config.domain_number = static_cast<std::uint8_t>(CONFIG_AR_PTP_DOMAIN);
#if defined(CONFIG_AR_PTP_VLAN) && CONFIG_AR_PTP_VLAN
    config.vlan_enabled = true;
    config.vlan_id = static_cast<std::uint16_t>(CONFIG_AR_PTP_VLAN_ID);
    config.vlan_priority = static_cast<std::uint8_t>(CONFIG_AR_PTP_VLAN_PRIORITY);
#else
    config.vlan_enabled = false;
    config.vlan_id = 0U;
    config.vlan_priority = 0U;
#endif
    config.port_number = static_cast<std::uint16_t>(CONFIG_AR_PTP_PORT_NUMBER);
    config.announce_interval_ms = static_cast<std::uint32_t>(CONFIG_AR_PTP_ANNOUNCE_INTERVAL_MS);
    config.sync_interval_ms = static_cast<std::uint32_t>(CONFIG_AR_PTP_SYNC_INTERVAL_MS);
#if defined(CONFIG_AR_PTP_RESPOND_PDELAY) && CONFIG_AR_PTP_RESPOND_PDELAY
    config.respond_to_peer_delay = true;
#else
    config.respond_to_peer_delay = false;
#endif
    config.priority1 = static_cast<std::uint8_t>(CONFIG_AR_PTP_PRIORITY1);
    config.priority2 = static_cast<std::uint8_t>(CONFIG_AR_PTP_PRIORITY2);
    config.clock_class = static_cast<std::uint8_t>(CONFIG_AR_PTP_CLOCK_CLASS);
    config.clock_accuracy = static_cast<std::uint8_t>(CONFIG_AR_PTP_CLOCK_ACCURACY);
    config.offset_scaled_log_variance =
        static_cast<std::uint16_t>(CONFIG_AR_PTP_OFFSET_SCALED_LOG_VARIANCE);
    config.time_source = static_cast<std::uint8_t>(CONFIG_AR_PTP_TIME_SOURCE);
    config.current_utc_offset = static_cast<std::int16_t>(CONFIG_AR_PTP_CURRENT_UTC_OFFSET);

    const std::string configured_identity{CONFIG_AR_PTP_CLOCK_IDENTITY};
    if (!configured_identity.empty()) {
        ar::iec61850::time_sync::PtpClockIdentity parsed{};
        if (try_parse_ptp_clock_identity(configured_identity, parsed)) {
            config.clock_identity_override = true;
            std::copy(parsed.begin(), parsed.end(), std::begin(config.clock_identity));
        }
    }
}

[[nodiscard]] ar_ptp_lab_config_t selected_config() noexcept {
    ar_ptp_lab_config_t result{};
    bool has_override = false;
    portENTER_CRITICAL(&g_control_mux);
    has_override = g_runtime_config_override_valid;
    if (has_override) result = g_runtime_config_override;
    portEXIT_CRITICAL(&g_control_mux);

    // Avoid heap/string work inside the critical section when defaults include
    // a textual ClockIdentity override.
    if (!has_override) fill_kconfig_defaults(result);
    return result;
}

[[nodiscard]] std::optional<PtpPublisherOptions> options_from_config(
    const ar_ptp_lab_config_t& config,
    const std::array<std::uint8_t, 6>& source_mac,
    std::string* validation_error = nullptr) {
    PtpPublisherOptions options;
    options.transport_specific = config.transport_specific;
    options.domain_number = config.domain_number;
    options.source_mac = source_mac;
    if (config.vlan_enabled) {
        options.vlan_id = config.vlan_id;
        options.vlan_priority = config.vlan_priority;
    } else {
        options.vlan_id = std::nullopt;
        options.vlan_priority = 0U;
    }
    options.clock_identity = ptp_clock_identity_from_mac(source_mac);
    if (config.clock_identity_override) {
        std::copy(
            std::begin(config.clock_identity),
            std::end(config.clock_identity),
            options.clock_identity.begin());
    }
    options.port_number = config.port_number;
    options.announce_interval = std::chrono::milliseconds{config.announce_interval_ms};
    options.sync_interval = std::chrono::milliseconds{config.sync_interval_ms};
    options.follow_up_delay = std::chrono::milliseconds::zero();
    // ESP32-P4 intentionally stays two-step so the exact EMAC egress timestamp
    // can be placed in Follow_Up instead of approximating a one-step timestamp.
    options.two_step_clock = true;
    options.respond_to_peer_delay = config.respond_to_peer_delay;
    options.priority1 = config.priority1;
    options.priority2 = config.priority2;
    options.clock_class = config.clock_class;
    options.clock_accuracy = static_cast<PtpClockAccuracy>(config.clock_accuracy);
    options.offset_scaled_log_variance = config.offset_scaled_log_variance;
    options.time_source = static_cast<PtpTimeSource>(config.time_source);
    options.current_utc_offset = config.current_utc_offset;

    std::string error;
    if (!PtpPublisherRuntime::validate_options(options, error)) {
        if (validation_error != nullptr) *validation_error = std::move(error);
        return std::nullopt;
    }
    if (validation_error != nullptr) validation_error->clear();
    return options;
}

[[nodiscard]] bool validate_runtime_config(
    const ar_ptp_lab_config_t& config,
    std::string& error) {
    if (config.clock_identity_override && all_zero_identity(config.clock_identity)) {
        error = "clockIdentity override must be non-zero";
        return false;
    }
    return options_from_config(config, kValidationMac, &error).has_value();
}

[[nodiscard]] std::optional<PtpPublisherOptions> make_runtime_options(
    const std::array<std::uint8_t, 6>& source_mac) {
    const auto config = selected_config();
    std::string validation_error;
    auto options = options_from_config(config, source_mac, &validation_error);
    if (!options.has_value()) {
        ESP_LOGE(kTag, "Invalid PTP runtime profile: %s", validation_error.c_str());
    }
    return options;
}

void reset_live_status() noexcept {
    g_announce_sent.store(0U, std::memory_order_release);
    g_sync_sent.store(0U, std::memory_order_release);
    g_follow_up_sent.store(0U, std::memory_order_release);
    g_pdelay_frames_sent.store(0U, std::memory_order_release);
    g_tx_failure_count.store(0U, std::memory_order_release);
}

void record_live_sent(const PtpMessageType message_type) noexcept {
    switch (message_type) {
    case PtpMessageType::announce:
        g_announce_sent.fetch_add(1U, std::memory_order_relaxed);
        break;
    case PtpMessageType::sync:
        g_sync_sent.fetch_add(1U, std::memory_order_relaxed);
        break;
    case PtpMessageType::follow_up:
        g_follow_up_sent.fetch_add(1U, std::memory_order_relaxed);
        break;
    case PtpMessageType::pdelay_resp:
    case PtpMessageType::pdelay_resp_follow_up:
        g_pdelay_frames_sent.fetch_add(1U, std::memory_order_relaxed);
        break;
    default:
        break;
    }
}

