masarray/arstack61850/embedded/esp32p4_smv_injector/main/ptp_lab_task.cpp
    portENTER_CRITICAL(&g_control_mux);
    if (g_ptp_started.load(std::memory_order_relaxed)) {
        portEXIT_CRITICAL(&g_control_mux);
        return;
    }
    g_ptp_started.store(true, std::memory_order_relaxed);
    portEXIT_CRITICAL(&g_control_mux);

    reset_live_status();
    g_ptp_ready.store(false, std::memory_order_release);
    g_ptp_accept_rx.store(false, std::memory_order_release);
    g_stop_requested.store(false, std::memory_order_release);
    g_ptp_context.eth_handle = eth_handle;
    g_ptp_context.runtime.reset();
    g_ptp_context.task_handle = nullptr;
    g_ptp_context.rx_respond_to_peer_delay = false;

    if (g_ptp_context.pdelay_queue == nullptr) {
        g_ptp_context.pdelay_queue = xQueueCreate(
            kPdelayQueueDepth,
            sizeof(PdelayRequestEvent));
    } else {
        xQueueReset(g_ptp_context.pdelay_queue);
    }
    if (g_ptp_context.pdelay_queue == nullptr) {
        ESP_LOGW(kTag, "Pdelay queue allocation failed; broadcaster will run without Pdelay RX responses");
    }

    if (xTaskCreatePinnedToCore(
            &ptp_lab_task,
            "ar_ptp_lab",
            7168,
            &g_ptp_context,
            4,
            &g_ptp_context.task_handle,
            0) != pdPASS) {
        g_ptp_context.task_handle = nullptr;
        g_ptp_started.store(false, std::memory_order_release);
        ESP_LOGE(kTag, "Failed to create PTP lab task on CPU0");
        return;
    }

    constexpr unsigned kStartReadyPolls = 160U;
    for (unsigned attempt = 0U; attempt < kStartReadyPolls; ++attempt) {
        if (g_ptp_ready.load(std::memory_order_acquire) || !g_ptp_started.load(std::memory_order_acquire)) return;
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    ESP_LOGE(kTag, "PTP source readiness timeout: no verified Announce/Sync/Follow_Up TX");
    stop_ptp_lab();
}

void stop_ptp_lab() noexcept {
    if (!g_ptp_started.load(std::memory_order_acquire)) return;
    g_stop_requested.store(true, std::memory_order_release);
    if (g_ptp_context.task_handle != nullptr) {
        xTaskNotifyGive(g_ptp_context.task_handle);
    }
    constexpr unsigned kCleanupPolls = 100U;
    for (unsigned attempt = 0U; attempt < kCleanupPolls; ++attempt) {
        if (!g_ptp_started.load(std::memory_order_acquire)) return;
        vTaskDelay(pdMS_TO_TICKS(5));
    }
    ESP_LOGE(kTag, "PTP SOURCE cleanup timeout; EMAC rollback incomplete after 500 ms");
}

[[nodiscard]] bool ptp_lab_is_running() noexcept {
    return g_ptp_ready.load(std::memory_order_acquire);
}

[[nodiscard]] bool configure_ptp_lab(const ar_ptp_lab_config_t& config) {
    if (g_ptp_started.load(std::memory_order_acquire)) return false;

    std::string error;
    if (!validate_runtime_config(config, error)) {
        ESP_LOGE(kTag, "PTP runtime configuration rejected: %s", error.c_str());
        return false;
    }

    portENTER_CRITICAL(&g_control_mux);
    if (g_ptp_started.load(std::memory_order_relaxed)) {
        portEXIT_CRITICAL(&g_control_mux);
        return false;
    }
    g_runtime_config_override = config;
    g_runtime_config_override_valid = true;
    portEXIT_CRITICAL(&g_control_mux);
    return true;
}

} // namespace
} // namespace ar::esp32p4::smv

extern "C" void ar_ptp_lab_get_default_config(ar_ptp_lab_config_t* config) {
    if (config == nullptr) return;
    ar::esp32p4::smv::fill_kconfig_defaults(*config);
}

extern "C" bool ar_ptp_lab_configure(const ar_ptp_lab_config_t* config) {
    if (config == nullptr) return false;
    return ar::esp32p4::smv::configure_ptp_lab(*config);
}

extern "C" bool ar_ptp_lab_get_config(ar_ptp_lab_config_t* config) {
    if (config == nullptr) return false;
    *config = ar::esp32p4::smv::selected_config();
    return true;
}

extern "C" void ar_ptp_lab_start(const esp_eth_handle_t eth_handle) {
    ar::esp32p4::smv::start_ptp_lab(eth_handle);
}

extern "C" void ar_ptp_lab_stop(void) {
    ar::esp32p4::smv::stop_ptp_lab();
}

extern "C" bool ar_ptp_lab_is_running(void) {
    return ar::esp32p4::smv::ptp_lab_is_running();
}

extern "C" bool ar_ptp_lab_get_status(ar_ptp_lab_status_t* status) {
    if (status == nullptr) return false;
    status->is_running = ar::esp32p4::smv::g_ptp_ready.load(std::memory_order_acquire);
    status->announce_sent = ar::esp32p4::smv::g_announce_sent.load(std::memory_order_relaxed);
    status->sync_sent = ar::esp32p4::smv::g_sync_sent.load(std::memory_order_relaxed);
    status->follow_up_sent = ar::esp32p4::smv::g_follow_up_sent.load(std::memory_order_relaxed);
    status->peer_delay_frames_sent =
        ar::esp32p4::smv::g_pdelay_frames_sent.load(std::memory_order_relaxed);
    status->tx_failure_count =
        ar::esp32p4::smv::g_tx_failure_count.load(std::memory_order_relaxed);
    return true;
}
